Repository: quarkusio/es.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en
Languages: es_es

source: ## How do you unify imperative and reactive programming?
es_es: ## ¿Cómo se unifica la programación imperativa y reactiva?

source: ## What are you doing to improve developer joy?
es_es: ## ¿Qué está haciendo para mejorar la alegría de los desarrolladores?

source: ## What does Container First mean?
es_es: ## ¿Qué significa contenedor primero?

source: ## What is GraalVM?
es_es: ## ¿Qué es GraalVM?

source: ## What is your view on standards?
es_es: ## ¿Cuál es su punto de vista sobre los estándares?

source: (optional?) `brew install llvm`
es_es: (¿opcional?) `brew install llvm`

source: **Important:** the guides are maintained in the main Quarkus repository and pull requests should be submitted there: https://github.com/quarkusio/quarkus/tree/main/docs/src/main/asciidoc.
es_es: **Importante:** las guías se mantienen en el repositorio principal de Quarkus y los pull requests deben enviarse allí: https://github.com/quarkusio/quarkus/tree/main/docs/src/main/asciidoc.

source: *Experimental*: early feedback is requested to mature the idea. There is no guarantee of stability nor long term presence in the platform until the solution matures. Such extensions are at the beginning of their maturation process.
es_es: *Experimental*: se solicita un feedback temprano para madurar la idea. No se garantiza la estabilidad ni la presencia a largo plazo en la plataforma hasta que la solución madure. Dichas extensiones están al comienzo de su proceso de maduración.

source: *Preview*: backward compatibility and presence in the ecosystem is not guaranteed. Specific improvements might require to change configuration or APIs and plans to become _stable_ are under way. Such extensions are in the middle of their maturation process.
es_es: *Preview*: la compatibilidad con versiones anteriores y la presencia en el ecosistema no están garantizadas. Ciertas mejoras pueden requerir cambios de configuración o API, y los planes para convertirse en _stable_ están en marcha. Estas extensiones están en pleno proceso de maduración.

source: *Stable*: backward compatibility and presence in the ecosystem are taken very seriously. An application can safely rely on these extensions. Extensions not marked as preview or experimental (the majority) are stable.
es_es: *Stable*: la compatibilidad con versiones anteriores y la presencia en el ecosistema se toman muy en serio. Una aplicacion pueden confiar de manera segura en estas extensiones. Las extensiónes no están marcadas como preview o experimental (la mayoría) son estables.

source: 1. Build your application as `mutable-jar`
es_es: 1. Construya su aplicación como `mutable-jar`

source: 2. Re-augment your application with a different build time configuration
es_es: 2. Vuelva a calibrar su aplicación con una configuración de tiempo de compilación diferente

source: 2.0 (Latest)
es_es: 2.0 (último)

source: 2020 Awards and Nominations
es_es: Premios y nominaciones 2020

source: 2021 Awards and Nominations
es_es: Premios y nominaciones 2021

source: 2021 Stevie Award
es_es: Premio Stevie 2021

source: 3. Optional: Delete the deployments folder
es_es: 3. Opcional: Eliminar la carpeta de despliegues

source: <a class="anchor" href="#being-reactive"></a>Being reactive
es_es: <a class="anchor" href="#being-reactive"></a>Ser reactivo

source: <a class="anchor" href="#event-driven-architectures"></a>Event-driven Architectures
es_es: <a class="anchor" href="#event-driven-architectures"></a>Arquitecturas dirigidas por eventos

source: <a class="anchor" href="#functions-as-a-service-and-serverless"></a>Functions as a Service and Serverless
es_es: <a class="anchor" href="#functions-as-a-service-and-serverless"></a>Funciones como servicio y sin servidor

source: <a class="anchor" href="#http-microservices"></a>HTTP microservices
es_es: <a class="anchor" href="#http-microservices"></a>Microservicios HTTP

source: <a href="#">62 Contributors</a>
es_es: <a href="#">62 Colaboradores</a>

source: <a href="#">Clear All</a>
es_es: <a href="#">Borrar todo</a>

source: <a href="#">Documentation</a>
es_es: <a href="#">Documentación</a>

source: <a href="#">Extension Repo</a>
es_es: <a href="#">Repositorio de extensiones</a>

source: <a href="#">JBeret Project</a>
es_es: <a href="#">Proyecto JBeret</a>

source: <a href="#">JBeret makes you jump higher</a>
es_es: <a href="#">JBeret te hace saltar más alto</a>

source: <a href="#">Passing</a>
es_es: <a href="#">Pasar</a>

source: <a href="#">Platform: Foo</a>
es_es: <a href="#">Plataforma: Foo</a>

source: <a href="#">Use Jberet to do something cool</a>
es_es: <a href="#">Usa Jberet para hacer algo genial</a>

source: <a href="#">Version 0.0.2</a>
es_es: <a href="#">Versión 0.0.2</a>

source: <a href="#">Version 1.1</a>
es_es: <a href="#">Versión 1.1</a>

source: <a href="/container-first">Container First</a>
es_es: <a href="/container-first">Contenedor primero</a>

source: <a href="/container-first">Learn more</a>>
es_es: <a href="/container-first">Más información</a>>

source: <a href="/continuum">Learn more</a>>
es_es: <a href="/continuum">Aprender más</a>>

source: <a href="/continuum">Unifies imperative and reactive</a>
es_es: <a href="/continuum">Unifica lo imperativo y lo reactivo</a>

source: <a href="/continuum/">Learn more about Reactive</a>
es_es: <a href="/continuum/">Más información sobre Reactive</a>

source: <a href="/developer-joy">Developer Joy</a>
es_es: <a href="/developer-joy">Alegría del desarrollador</a>

source: <a href="/developer-joy">Learn more</a>>
es_es: <a href="/developer-joy">Aprenda más</a>>

source: <a href="/developer-joy/">Learn more about Developer Joy</a>
es_es: <a href="/developer-joy/">Conozca más sobre Alegría para el desarrollador</a>

source: <a href="/kubernetes-native/">Learn more about Kubernetes-native</a>
es_es: <a href="/kubernetes-native/">Aprenda más sobre Kubernetes-native</a>

source: <a href="/standards">Community and Standards</a>
es_es: <a href="/standards">Comunidad y normas</a>

source: <a href="/standards">Learn more</a>>
es_es: <a href="/standards">Más información</a>>

source: <a href="/standards/">Learn more about Standards</a>
es_es: <a href="/standards/">Más información sobre los estándares</a>

source: <a href="https://code.quarkus.io" class="button-cta secondary white">START CODING</a>
es_es: <a href="https://code.quarkus.io" class="button-cta secondary white">Empezar a codificar</a>

source: <a href="https://code.quarkus.io">Start Coding</a> with Quarkus {{ site.data.versions.quarkus.version }} [<a href="{{ site.data.versions.quarkus.announce }}">announce</a>|<a href="https://github.com/quarkusio/quarkus/releases/tag/{{ site.data.versions.quarkus.version }}">changelog</a>]
es_es: <a href="https://code.quarkus.io">Comienza a codificar</a> con Quarkus {{ site.data.versions.quarkus.version }} [<a href="{{ site.data.versions.quarkus.announce }}">announce</a>|<a href="https://github.com/quarkusio/quarkus/releases/tag/{{ site.data.versions.quarkus.version }}">changelog</a>]

source: <a href="https://github.com/orgs/quarkusio/projects/13/views/1" class="{% if page.url contains '/roadmap/' %}active{% endif %}">ROADMAP</a>
es_es: <a href="https://github.com/orgs/quarkusio/projects/13/views/1" class="{% if page.url contains '/roadmap/' %}active{% endif %}">Hoja de ruta</a>

source: <a href="https://github.com/quarkusio/quarkus/discussions">Go to the Quarkus GitHub Discussions<i class="fas fa-external-link-alt"></i></a>
es_es: <a href="https://github.com/quarkusio/quarkus/discussions">Ir a las discusiones de GitHub de Quarkus<i class="fas fa-external-link-alt"></i></a>

source: <a href="https://github.com/quarkusio/quarkus/discussions/categories/events">Check out the "Events" section of Quarkus Discussions</a> for additional community related events.
es_es: <a href="https://github.com/quarkusio/quarkus/discussions/categories/events">Consulta la sección "Eventos" de Discusiones Quarkus</a> para ver otros eventos relacionados con la comunidad.

source: <a href="https://hub.quarkiverse.io" class="{% if page.url contains 'hub.quarkiverse.io' %}active{% endif %}">SHARE EXTENSIONS</a>
es_es: <a href="https://hub.quarkiverse.io" class="{% if page.url contains 'hub.quarkiverse.io' %}active{% endif %}">BUSCAR EXTENSIONES</a>

source: <a href="https://quarkus.io/extensions/" class="{% if page.url contains '/extensions/' %}active{% endif %}">BROWSE EXTENSIONS</a>
es_es: <a href="https://quarkus.io/extensions/" class="{% if page.url contains '/extensions/' %}active{% endif %}">BUSCAR EXTENSIONES</a>

source: <a href="https://www.redhat.com/en/topics/cloud-native-apps/why-choose-red-hat-quarkus" class="button-cta btn-sm">Red Hat Support</a>
es_es: <a href="https://www.redhat.com/en/topics/cloud-native-apps/why-choose-red-hat-quarkus" class="button-cta btn-sm">Soporte de Red Hat</a>

source: <a href="{{ site.data.versions.quarkus.announce }}">More Information</a>
es_es: <a href="{{ site.data.versions.quarkus.announce }}">Más información</a>

source: <a href="{{ site.data.versions.quarkus.announce }}">Read the release notes</a>
es_es: <a href="{{ site.data.versions.quarkus.announce }}">Lea las notas de la versión</a>

source: <a href="{{site.baseurl}}/about" class="{% if page.url contains '/about/' %}active{% endif %}">WHAT IS QUARKUS?</a>
es_es: <a href="{{site.baseurl}}/about" class="{% if page.url contains '/about/' %}active{% endif %}">¿QUE ES QUARKUS?</a>

source: <a href="{{site.baseurl}}/books" class="{% if page.url contains '/books/' %}active{% endif %}">BOOKS</a>
es_es: <a href="{{site.baseurl}}/books" class="{% if page.url contains '/books/' %}active{% endif %}">LIBROS</a>

source: <a href="{{site.baseurl}}/catalog">Extension Catalog</a> <i class="fas fa-chevron-right"></i> {{ page.title }}
es_es: <a href="{{site.baseurl}}/catalog">Catálogo de extensiones</a> <i class="fas fa-chevron-right"></i> {{ page.title }}

source: <a href="{{site.baseurl}}/container-first" class="{% if page.url contains '/container-first/' %}active{% endif %}">CONTAINER FIRST</a>
es_es: <a href="{{site.baseurl}}/container-first" class="{% if page.url contains '/container-first/' %}active{% endif %}">CONTENEDOR PRIMERO</a>

source: <a href="{{site.baseurl}}/continuum" class="{% if page.url contains '/continuum/' %}active{% endif %}">REACTIVE</a>
es_es: <a href="{{site.baseurl}}/continuum" class="{% if page.url contains '/continuum/' %}active{% endif %}">REACTIVO</a>

source: <a href="{{site.baseurl}}/createextensions"> Learn How </a>
es_es: <a href="{{site.baseurl}}/createextensions"> Aprende cómo /a>

source: <a href="{{site.baseurl}}/developer-joy" class="{% if page.url contains '/developer-joy/' %}active{% endif %}">DEVELOPER JOY</a>
es_es: <a href="{{site.baseurl}}/developer-joy" class="{% if page.url contains '/developer-joy/' %}active{% endif %}">SATISFACCION DEL DESARROLLADOR</a>

source: <a href="{{site.baseurl}}/discussion" class="{% if page.url contains '/discussion/' %}active{% endif %}">DISCUSSION</a>
es_es: <a href="{{site.baseurl}}/discussion" class="{% if page.url contains '/discussion/' %}active{% endif %}">DISCUSIONES</a>

source: <a href="{{site.baseurl}}/events" class="{% if page.url contains '/events/' %}active{% endif %}">EVENTS</a>
es_es: <a href="{{site.baseurl}}/events" class="{% if page.url contains '/events/' %}active{% endif %}">EVENTOS</a>

source: <a href="{{site.baseurl}}/faq/#what-is-a-quarkus-extension" class="{% if page.url contains 'what-is-a-quarkus-extension' %}active{% endif %}">USE EXTENSIONS</a>
es_es: <a href="{{site.baseurl}}/faq/#what-is-a-quarkus-extension" class="{% if page.url contains 'what-is-a-quarkus-extension' %}active{% endif %}">USAR EXTENSIONES</a>

source: <a href="{{site.baseurl}}/get-started" class="{% if page.url contains '/get-started/' %}active{% endif %}">GET STARTED</a>
es_es: <a href="{{site.baseurl}}/get-started" class="{% if page.url contains '/get-started/' %}active{% endif %}">EMPEZAR</a>

source: <a href="{{site.baseurl}}/get-started/" class="button-cta">Get Started with Quarkus</a> <a href="{{site.baseurl}}/guides/" class="button-cta">Read the Guides</a>
es_es: <a href="{{site.baseurl}}/get-started/" class="button-cta">Comienza con Quarkus</a> <a href="{{site.baseurl}}/guides/" class="button-cta">Lea las Guías</a>

source: <a href="{{site.baseurl}}/guides" class="{% if page.url contains '/guides/' %}active{% endif %}">DOCUMENTATION</a>
es_es: <a href="{{site.baseurl}}/guides" class="{% if page.url contains '/guides/' %}active{% endif %}">DOCUMENTACION</a>

source: <a href="{{site.baseurl}}/guides/cli-tooling">Read the CLI Tooling guide</a>
es_es: <a href="{{site.baseurl}}/guides/cli-tooling">Lee la guía de CLI Tooling</a>

source: <a href="{{site.baseurl}}/guides/continuous-testing">Read the Continuous Testing guide</a>
es_es: <a href="{{site.baseurl}}/guides/continuous-testing">Lea la guía de Pruebas continuas</a>

source: <a href="{{site.baseurl}}/guides/dev-services">Read the Dev Services guide</a>
es_es: <a href="{{site.baseurl}}/guides/dev-services">Lea la guía de servicios de desarrollo</a>

source: <a href="{{site.baseurl}}/guides/dev-ui">Read the Dev UI guide</a>
es_es: <a href="{{site.baseurl}}/guides/dev-ui">Lee la guía de la interfaz de usuario de desarrollo</a>

source: <a href="{{site.baseurl}}/guides/maven-tooling#dev-mode/">Read the Dev Mode guide</a>
es_es: <a href="{{site.baseurl}}/guides/maven-tooling#dev-mode/">Lee la guía del modo desarrollador</a>

source: <a href="{{site.baseurl}}/guides/maven-tooling#remote-development-mode">Read the Remote Development Mode guide</a>
es_es: <a href="{{site.baseurl}}/guides/maven-tooling#remote-development-mode">Lee la guía del modo de desarrollo remoto</a>

source: <a href="{{site.baseurl}}/guides/writing-extensions" class="{% if page.url contains '/guides/writing-extensions' %}active{% endif %}">CREATE EXTENSIONS</a>
es_es: <a href="{{site.baseurl}}/guides/writing-extensions" class="{% if page.url contains '/guides/writing-extensions' %}active{% endif %}">CREAR EXTENSIONES</a>

source: <a href="{{site.baseurl}}/standards" class="{% if page.url contains '/standards/' %}active{% endif %}">STANDARDS</a>
es_es: <a href="{{site.baseurl}}/standards" class="{% if page.url contains '/standards/' %}active{% endif %}">ESTANDARES</a>

source: <a href="{{site.baseurl}}/support/" class="{% if page.url contains '/support/' %}active{% endif %}">SUPPORT</a>
es_es: <a href="{{site.baseurl}}/support/" class="{% if page.url contains '/support/' %}active{% endif %}">SOPORTE</a>

source: <a href="{{site.baseurl}}/worldtour/">Learn more about the Quarkus World Tour</a>
es_es: <a href="{{site.baseurl}}/worldtour/">Aprende más sobre la gira mundial de Quarkus</a>

source: <code>chunk</code> - A simple Job that reads, processes, and stores data from a file.
es_es: <code>chunk</code> - Un simple trabajo que lee, procesa y almacena datos de un archivo.

source: <code>jdbc-repository</code> - A Job that uses a jdbc datasource to store JBeret and Job metadata.
es_es: <code>jdbc-repository</code> - Un trabajo que utiliza una fuente de datos jdbc para almacenar JBeret y los metadatos del trabajo.

source: <code>scheduler</code> - Schedule a Job to run every 10 seconds
es_es: <code>scheduler</code> - Programar un trabajo para que se ejecute cada 10 segundos

source: <input type="checkbox" id="altlanguages" name="altlanguages" value="altlanguages"><label for="altlanguages"> Alternative Languages</label>
es_es: <input type="checkbox" id="altlanguages" name="altlanguages" value="altlanguages"><label for="altlanguages">Lenguajes alternativos</label>

source: <input type="checkbox" id="busautomation" name="busautomation" value="busautomation"><label for="busautomation"> Business Automation</label>
es_es: <input type="checkbox" id="busautomation" name="busautomation" value="busautomation"><label for="busautomation"> Automatización empresarial</label>

source: <input type="checkbox" id="compatibility" name="compatibility" value="compatibility"><label for="compatibility"> Compatibility</label>
es_es: <input type="checkbox" id="compatibility" name="compatibility" value="compatibility"><label for="compatibility"> Compatibilidad</label>

source: <input type="checkbox" id="integration" name="integration" value="integration"><label for="integration"> Integration</label>
es_es: <input type="checkbox" id="integration" name="integration" value="integration"><label for="integration"> Integración</label>

source: <input type="checkbox" id="miscellaneous" name="miscellaneous" value="miscellaneous"><label for="miscellaneous"> Miscellaneous</label>
es_es: <input type="checkbox" id="miscellaneous" name="miscellaneous" value="miscellaneous"><label for="miscellaneous">Miscelánea</label>

source: <input type="checkbox" id="serialization" name="serialization" value="serialization"><label for="serialization"> Serialization</label>
es_es: <input type="checkbox" id="serialization" name="serialization" value="serialization"><label for="serialization"> Serialización</label>

source: <span href="https://quarkus.io/extensions/">Extensions<i class="fas fa-chevron-down"></i></span>
es_es: <span href="https://quarkus.io/extensions/">Extensiones<i class="fas fa-chevron-down"></i></span>

source: <span href="{{site.baseurl}}/about/">Why<i class="fas fa-chevron-down"></i></span>
es_es: <span href="{{site.baseurl}}/about/">Por que <i class="fas fa-chevron-down"></i></span>

source: <span href="{{site.baseurl}}/community/">Community<i class="fas fa-chevron-down"></i></span>
es_es: <span href="{{site.baseurl}}/community/">Comunidad <i class="fas fa-chevron-down"></i></span>

source: <span href="{{site.baseurl}}/learn/">Learn<i class="fas fa-chevron-down"></i></span>
es_es: <span href="{{site.baseurl}}/learn/">Aprende <i class="fas fa-chevron-down"></i></span>

source: A Job can also be scheduled programmatically, using the JobScheduler API and the Quarkus startup event:
es_es: Un trabajo también puede ser programado, utilizando la API JobScheduler y el evento de inicio de Quarkus:

source: A Kubernetes Native Java stack tailored for OpenJDK HotSpot and GraalVM, crafted from the best of breed Java libraries and standards.
es_es: Un Java stack nativo de Kubernetes adaptado a OpenJDK HotSpot y GraalVM, elaborado a partir de las mejores bibliotecas y estándares Java.

source: A capability may be provided or required only if a certain condition is satisfied, for example, if a certain configuration option is enabled or based on some other condition. Here is how a conditional capability promise can be configured:
es_es: Una capacidad puede ser proporcionada o requerida sólo si se cumple una determinada condición, por ejemplo, si una determinada opción de configuración está habilitada o en base a alguna otra condición. Así es como se puede configurar una promesa de capacidad condicional:

source: A capability represents a technical aspect, for example, it could be an implementation of some functionality, a contract or a specification. Each capability has a name which should follow the Java package naming convention, e.g. `io.quarkus.rest`.
es_es: Una capacidad representa un aspecto técnico, por ejemplo, puede ser una implementación de alguna funcionalidad, un contrato o una especificación. Cada capacidad tiene un nombre que debe seguir la convención de nomenclatura de paquetes de Java, por ejemplo, `io.quarkus.rest`.

source: A cohesive platform for optimized developer joy with unified configuration and no hassle native executable generation. Zero config, live reload in the blink of an eye and streamlined code for the 80% common usages, flexible for the remainder 20%.
es_es: Una plataforma cohesiva para la alegría optimizada de los desarrolladores con una configuración unificada y una generación de ejecutables nativos sin complicaciones. Cero configuración, recarga en vivo en un abrir y cerrar de ojos y código racionalizado para el 80% de los usos comunes, flexible para el 20% restante.

source: A cohesive platform for optimized developer joy:
es_es: Una plataforma cohesionada para el disfrute optimizado de los desarrolladores:

source: A conditional dependency is configured in the runtime artifact of a Quarkus extension. In our example, it's the `quarkus-extension-a` that has a conditional dependency on `quarkus-extension-b`, which can be expressed in two ways.
es_es: Una dependencia condicional se configura en el artefacto de tiempo de ejecución de una extensión de Quarkus. En nuestro ejemplo, es el `quarkus-extension-a` el que tiene una dependencia condicional de `quarkus-extension-b`, que puede expresarse de dos maneras.

source: A haiku for you.
es_es: Un haiku para usted.

source: A periodical video podcast hosted by Quarkus Developers about things moving in and around Quarkus ecosystem. View the <a href="{{site.baseurl}}/insights">live podcasts</a> and check out older episodes on the Podcasts.
es_es: Un video podcast periódico presentado por los desarrolladores de Quarkus sobre las cosas que se mueven en el ecosistema de Quarkus y sus alrededores. Vea los <a href="{{site.baseurl}}/insights">podcasts en vivo</a> y consulte los episodios más antiguos en los Podcasts.

source: A test that runs with authorization disabled can just set the enabled property to false:
es_es: Una prueba que se ejecuta con la autorización deshabilitada puede simplemente establecer la propiedad enabled en false:

source: A unique experience with access to Quarkus experts designed to help you get started with Java in a Kubernetes world.
es_es: Una experiencia única con acceso a expertos de Quarkus diseñada para ayudarte a empezar con Java en un mundo Kubernetes.

source: A very common use case is to deploy a Quarkus application that needs to access a relational database which has itself already been deployed on Kubernetes. Using the `quarkus-kubernetes-config` extension makes this use case very simple to handle.
es_es: Un caso de uso muy común es desplegar una aplicación de Quarkus que necesita acceder a una base de datos relacional que a su vez ya ha sido desplegada en Kubernetes. El uso de la extensión `quarkus-kubernetes-config` hace que este caso de uso sea muy sencillo de manejar.

source: A virtual (and in person where possible) tour of Java User Groups creating a unique hands-on experience with access to Quarkus experts designed to help you get started with Java in a Kubernetes world.
es_es: Un tour virtual (y en persona cuando sea posible) de los grupos de usuarios de Java creando una experiencia práctica única con acceso a los expertos de Quarkus diseñada para ayudarte a empezar con Java en un mundo Kubernetes.

source: AMQP Body Type
es_es: Tipo de cuerpo AMQP

source: AMQP Connector Configuration Reference
es_es: Referencia de la configuración del conector AMQP

source: AMQP Data (with binary content) and the `content-type` is set to `application/json`
es_es: AMQP Data (con contenido binario) y el `content-type` está configurado como `application/json`

source: AMQP Data using a binary content. No `content-type` set
es_es: Datos AMQP utilizando un contenido binario. No se ha establecido `content-type`

source: AMQP Data using a binary content. The `content-type` is set to `application/json`
es_es: Datos AMQP utilizando un contenido binario. El `content-type` está configurado como `application/json`

source: AMQP Data with a different `content-type`
es_es: Datos AMQP con un `content-type`

source: AMQP Message Body
es_es: Cuerpo del mensaje AMQP

source: AMQP Sequence
es_es: Secuencia AMQP

source: AMQP Value using the `Binary` type
es_es: Valor AMQP utilizando el tipo `Binary`

source: AMQP Value using the corresponding AMQP Type
es_es: Valor AMQP utilizando el tipo AMQP correspondiente

source: AMQP Value with the payload
es_es: Valor AMQP con la carga útil

source: AMQP connector extension
es_es: Extensión del conector AMQP
